# Add new columns to a DataFrame

In [1]:
import pandas as pd
import numpy as np

### Create an example DataFrame of normally distributed random numbers:

In [2]:
# Use a random seed to make reproducible data.
np.random.seed(1)
df = pd.DataFrame(np.random.randn(5,4), columns=list("ABCD"))
df

          A         B         C         D
0  1.624345 -0.611756 -0.528172 -1.072969
1  0.865408 -2.301539  1.744812 -0.761207
2  0.319039 -0.249370  1.462108 -2.060141
3 -0.322417 -0.384054  1.133769 -1.099891
4 -0.172428 -0.877858  0.042214  0.582815

### Add a new column with 1 value:

In [3]:
df["E"] = np.nan
df

          A         B         C         D   E
0  1.624345 -0.611756 -0.528172 -1.072969 NaN
1  0.865408 -2.301539  1.744812 -0.761207 NaN
2  0.319039 -0.249370  1.462108 -2.060141 NaN
3 -0.322417 -0.384054  1.133769 -1.099891 NaN
4 -0.172428 -0.877858  0.042214  0.582815 NaN

### Add a series as a new column:

In [4]:
# Add a categorical series the same length as the DataFrame:
categorical_series = np.random.choice(["cat", "dog"], size=(5,1))
df["cat_column"] = categorical_series
df

          A         B         C         D   E cat_column
0  1.624345 -0.611756 -0.528172 -1.072969 NaN        cat
1  0.865408 -2.301539  1.744812 -0.761207 NaN        cat
2  0.319039 -0.249370  1.462108 -2.060141 NaN        dog
3 -0.322417 -0.384054  1.133769 -1.099891 NaN        dog
4 -0.172428 -0.877858  0.042214  0.582815 NaN        cat